sistema/app/Models/UserModel.php

    public function buscarPorEmailConRol(string $email): ?array
    {
        return $this->db->table('personas p')
            ->select('
                p.id_persona,
                p.primer_nombre,
                p.segundo_nombre,
                p.primer_apellido,
                p.segundo_apellido,
                p.email,
                p.contrasena,
                r.texto_rol
            ')
            ->join('roles_has_persona rhp', 'rhp.personas_id_persona = p.id_persona', 'left')
            ->join('roles r',              'r.id_rol = rhp.roles_id_rol',             'left')
            ->where('p.email', $email)
            ->get()
            ->getRowArray();   // devuelve un array o null
---
SELECT `p`.`id_persona`, `p`.`primer_nombre`, `p`.`segundo_nombre`, `p`.`primer_apellido`, `p`.`segundo_apellido`, `p`.`email`, `p`.`contrasena`, `r`.`texto_rol`
FROM `personas` `p`
LEFT JOIN `roles_has_persona` `rhp` ON `rhp`.`personas_id_persona` = `p`.`id_persona`
LEFT JOIN `roles` `r` ON `r`.`id_rol` = `rhp`.`roles_id_rol`
WHERE `p`.`email` = 'san@example.com'